{
  "navbar": {
    "home": "Startseite",
    "about": "Über mich",
    "techstack": "Fähigkeiten",
    "experience": "Erfahrung",
    "projects": "Projekte",
    "certifications": "Zertifikate",
    "languages": "Sprache"
  },
  "header": {
    "title": "Hallo, ich bin",
    "subtitle": "Ein leidenschaftlicher <span class='font-bold text-white'>Webentwickler</span>, motiviert <span class='font-bold text-white'>zu lernen und beizutragen</span> mit meinem Wissen und meinen Fähigkeiten, um <span class='font-bold text-white'>digitale Lösungen</span> für Unternehmen und Ideen zu schaffen."
  },
  "typewriter": {
    "web_developer": "Webentwickler",
    "web_designer": "Webdesigner",
    "programmer": "Programmierer"
  },
  "techstack": {
    "title": "Fähigkeiten",
    "tools": "Werkzeuge"
  },
  "habilities": {
    "passionate": "Leidenschaftlich",
    "creative": "Kreativ",
    "proactive": "Proaktiv",
    "cooperative": "Kooperativ",
    "responsible": "Verantwortungsbewusst"
  },
  "experience": {
    "title": "Erfahrung",
    "marketec360": {
      "date": "März 2025",
      "title": "Frontend-Entwickler",
      "description": "Frontend-Entwickler bei Marketec360, wo ich an der Entwicklung von Webanwendungen mit modernen Technologien wie React, TypeScript und Tailwind CSS gearbeitet habe. Ich habe an umfangreichen Projekten mitgewirkt, die Benutzererfahrung verbessert und responsive sowie barrierefreie Benutzeroberflächen gestaltet."
    },
    "searching": {
      "date": "Derzeit",
      "title": "Auf der Suche nach neuen Möglichkeiten",
      "description": "Ich bin derzeit auf der Suche nach neuen beruflichen Möglichkeiten, bei denen ich meine Fähigkeiten einsetzen und mich weiterentwickeln kann. Ich bin offen für herausfordernde Projekte, die mir Lernmöglichkeiten bieten und zum Teamerfolg beitragen."
    }
  },
  "projects": {
    "title": "Projekte",
    "gymtinajo": {
      "title": "Fitnessstudio Tinajo",
      "description_summary": "Mehr anzeigen",
      "description": "Dieses Projekt ist eine Website zur Buchung von Fitnesskursen, die sowohl eine Kunden- als auch eine Administratoroberfläche bietet. Sie ermöglicht die Registrierung von Kunden sowie die Verwaltung von Buchungen und Mitteilungen der Einrichtung."
    },
    "weatherApp": {
      "title": "Wetter-App",
      "description_summary": "Mehr anzeigen",
      "description": "Eine Webanwendung, die das aktuelle Wetter und Vorhersagen mit der WeatherApi anzeigt. Benutzer können nach Städten suchen und detaillierte Wetterinformationen einsehen."
    }
  },
  "certifications": {
    "title": "Zertifikate",
    "responsiveCertification": {
      "title": "Responsives Design",
      "alt": "Zertifikat in responsivem Design von FreeCodeCamp"
    }
  },
  "footer": {
    "builtWith": "Erstellt mit",
    "followMe": "Folge mir",
    "legal": "Rechtliches",
    "privacyPolicy": "Datenschutzerklärung",
    "termsAndConditions": "Allgemeine Geschäftsbedingungen",
    "allRightsReserved": "Alle Rechte vorbehalten."
  },
  "privacy": {
    "title": "Datenschutzerklärung",
    "lastUpdate": "Letzte Aktualisierung: 4. Juni 2025",
    "intro": "Diese Datenschutzerklärung erklärt, wie Informationen von Benutzern dieser Website gesammelt, verwendet und geschützt werden.",
    "section1": {
      "title": "1. Erhobene Informationen",
      "content": "Personenbezogene Daten, die du über das Kontaktformular angibst (z. B. Name und E-Mail-Adresse). Automatisch erfasste Daten durch Tools wie Google Analytics (z. B. IP-Adresse, Browser, besuchte Seiten, Verweildauer)."
    },
    "section2": {
      "title": "2. Verwendung der Informationen",
      "content": "Die gesammelten Informationen werden ausschließlich zur Beantwortung von Anfragen über das Formular und zur Verbesserung der Benutzererfahrung verwendet."
    },
    "section3": {
      "title": "3. Weitergabe an Dritte",
      "content": "Deine persönlichen Daten werden nicht verkauft, getauscht oder mit Dritten geteilt, außer zur Nutzung von Analyse-Tools wie Google Analytics."
    },
    "section4": {
      "title": "4. Cookies",
      "content": "Diese Website kann Cookies verwenden, um anonyme statistische Daten zu sammeln. Du kannst Cookies in deinen Browsereinstellungen deaktivieren."
    },
    "section5": {
      "title": "5. Rechte der Nutzer",
      "content": "Du hast das Recht, deine personenbezogenen Daten jederzeit einzusehen, zu berichtigen oder löschen zu lassen. Schreibe dazu an: [deinemail@beispiel.de]"
    },
    "section6": {
      "title": "6. Änderungen an dieser Richtlinie",
      "content": "Diese Richtlinie kann gelegentlich aktualisiert werden. Es wird empfohlen, sie regelmäßig zu überprüfen."
    }
  },
  "terms": {
    "title": "Allgemeine Geschäftsbedingungen",
    "lastUpdate": "Letzte Aktualisierung: 4. Juni 2025",
    "intro": "Durch den Zugriff auf diese Website erklärst du dich mit den folgenden Bedingungen einverstanden. Wenn du mit einem Punkt nicht einverstanden bist, nutze die Website bitte nicht.",
    "section1": {
      "title": "1. Geistiges Eigentum",
      "content": "Alle Inhalte dieser Website (Texte, Bilder, Designs, Code usw.) sind Eigentum des Portfoliobesitzers, sofern nicht anders angegeben. Eine Vervielfältigung ohne vorherige Genehmigung ist nicht gestattet."
    },
    "section2": {
      "title": "2. Nutzung der Website",
      "content": "Diese Website dient ausschließlich Informations- und Berufs­zwecken. Die Nutzung für illegale Aktivitäten oder zur Verletzung von Rechten Dritter ist verboten."
    },
    "section3": {
      "title": "3. Externe Links",
      "content": "Diese Website kann Links zu anderen Websites enthalten. Ich übernehme keine Verantwortung für deren Inhalte oder Datenschutzrichtlinien."
    },
    "section4": {
      "title": "4. Haftungsausschluss",
      "content": "Diese Website wird \"wie sie ist\" bereitgestellt, ohne Garantie für Verfügbarkeit, Genauigkeit oder unterbrechungsfreien Betrieb."
    },
    "section5": {
      "title": "5. Änderungen",
      "content": "Die hier aufgeführten Bedingungen können ohne Vorankündigung geändert werden. Die weitere Nutzung der Website gilt als Zustimmung zu diesen Änderungen."
    }
  }
}
