{
  "navbar": {
    "home": "Startseite",
    "about": "Über mich",
    "techstack": "Kenntnisse",
    "experience": "Erfahrung",
    "projects": "Projekte",
    "languages": "Sprache"
  },
  "header": {
    "title": "Hallo, ich bin",
    "subtitle": "Ein leidenschaftlicher <span class='font-bold text-white'>Webentwickler</span>, der bereit ist, <span class='font-bold text-white'>zu lernen und beizutragen</span> und sein Wissen und seine Fähigkeiten einsetzt, um <span class='font-bold text-white'>Lösungen zur Digitalisierung</span> von Unternehmen und Ideen zu schaffen."
  },
  "typewriter": {
    "web_developer": "Webentwickler",
    "web_designer": "Webdesigner",
    "programmer": "Programmierer"
  },
  "techstack": {
    "title": "Kenntnisse",
    "tools": "Werkzeuge"
  },
  "habilities": {
    "passionate": "Leidenschaftlich",
    "creative": "Kreativ",
    "proactive": "Proaktiv",
    "cooperative": "Kooperativ",
    "responsible": "Verantwortungsbewusst"
  },
  "experience": {
    "title": "Erfahrung",
    "marketec360": {
      "date": "März 2025",
      "title": "Frontend-Entwickler",
      "description": "Frontend-Entwickler bei Marketec360, wo ich an der Entwicklung von Webanwendungen mit modernen Technologien wie React, TypeScript und Tailwind CSS gearbeitet habe. Ich habe an groß angelegten Projekten mitgewirkt, die Benutzererfahrung verbessert und responsive sowie barrierefreie Benutzeroberflächen gestaltet."
    },
    "searching": {
      "date": "Derzeit",
      "title": "Auf der Suche nach neuen Möglichkeiten",
      "description": "Derzeit bin ich auf der Suche nach neuen beruflichen Möglichkeiten, bei denen ich meine Fähigkeiten einbringen und mich weiterentwickeln kann. Ich bin offen für herausfordernde Projekte, die es mir ermöglichen, zu lernen und zum Erfolg des Teams beizutragen."
    }
  },
  "projects": {
    "title": "Projekte"
  },
  "footer": {
    "builtWith": "Erstellt mit",
    "followMe": "Folge mir",
    "legal": "Rechtliches",
    "privacyPolicy": "Datenschutzerklärung",
    "termsAndConditions": "Allgemeine Geschäftsbedingungen",
    "allRightsReserved": "Alle Rechte vorbehalten."
  },
    "privacy": {
    "title": "Datenschutzerklärung",
    "lastUpdate": "Letzte Aktualisierung: 4. Juni 2025",
    "intro": "Diese Datenschutzerklärung erklärt, wie die Informationen der Nutzer, die diese Website besuchen, gesammelt, verwendet und geschützt werden.",
    "section1": {
      "title": "1. Erhobene Informationen",
      "content": "Personenbezogene Daten, die du über das Kontaktformular angibst (wie dein Name und deine E-Mail-Adresse). Automatisch erfasste Daten durch Tools wie Google Analytics (z. B. deine IP-Adresse, Browser, besuchte Seiten und Verweildauer)."
    },
    "section2": {
      "title": "2. Verwendung der Informationen",
      "content": "Die gesammelten Informationen werden ausschließlich dazu verwendet, auf über das Formular gesendete Anfragen zu antworten und die Nutzererfahrung auf der Website zu verbessern."
    },
    "section3": {
      "title": "3. Weitergabe von Daten an Dritte",
      "content": "Deine persönlichen Daten werden nicht verkauft, getauscht oder an Dritte weitergegeben, außer für die Nutzung von Analysediensten wie Google Analytics."
    },
    "section4": {
      "title": "4. Cookies",
      "content": "Diese Website kann Cookies verwenden, um anonyme statistische Daten zu sammeln. Du kannst Cookies in den Einstellungen deines Browsers deaktivieren."
    },
    "section5": {
      "title": "5. Rechte der Nutzer",
      "content": "Du hast das Recht, jederzeit auf deine personenbezogenen Daten zuzugreifen, sie zu berichtigen oder zu löschen. Schreibe dazu an: [deinemail@beispiel.com]"
    },
    "section6": {
      "title": "6. Änderungen dieser Richtlinie",
      "content": "Diese Richtlinie kann gelegentlich aktualisiert werden. Es wird empfohlen, sie regelmäßig zu überprüfen."
    }
    },
  "terms": {
    "title": "Allgemeine Geschäftsbedingungen",
    "lastUpdate": "Letzte Aktualisierung: 4. Juni 2025",
    "intro": "Mit dem Zugriff auf diese Website akzeptierst du die folgenden allgemeinen Geschäftsbedingungen. Wenn du mit einem dieser Punkte nicht einverstanden bist, nutze die Website bitte nicht.",
    "section1": {
      "title": "1. Geistiges Eigentum",
      "content": "Alle Inhalte dieser Website (Texte, Bilder, Designs, Code usw.) sind Eigentum des Autors des Portfolios, sofern nicht anders angegeben. Eine Vervielfältigung ohne vorherige Genehmigung ist nicht gestattet."
    },
    "section2": {
      "title": "2. Nutzung der Website",
      "content": "Diese Website dient Informations- und Berufs­zwecken. Es ist untersagt, sie für illegale Aktivitäten oder zur Verletzung der Rechte Dritter zu nutzen."
    },
    "section3": {
      "title": "3. Externe Links",
      "content": "Die Website kann Links zu anderen Websites enthalten. Für deren Inhalte oder Datenschutzrichtlinien übernehme ich keine Verantwortung."
    },
    "section4": {
      "title": "4. Haftungsausschluss",
      "content": "Diese Website wird \"wie besehen\" bereitgestellt, ohne Gewähr für Verfügbarkeit, Genauigkeit oder unterbrechungsfreien Betrieb."
    },
    "section5": {
      "title": "5. Änderungen",
      "content": "Die hier aufgeführten Bedingungen können ohne vorherige Ankündigung geändert werden. Die fortgesetzte Nutzung der Website gilt als Zustimmung zu diesen Änderungen."
    }
  }
}