{
  "navbar": {
    "home": "Home",
    "about": "About Me",
    "techstack": "Tech Stack",
    "experience": "Experience",
    "projects": "Projects",
    "languages": "Language"
  },
  "header": {
    "title": "Hi, I'm",
    "subtitle": "A passionate <span class='font-bold text-white'>web developer</span>, eager to <span class='font-bold text-white'>learn and contribute</span> my knowledge and skills by creating <span class='font-bold text-white'>solutions to digitalize</span> businesses and ideas."
  },
  "typewriter": {
    "web_developer": "Web Developer",
    "web_designer": "Web Designer",
    "programmer": "Programmer"
  },
  "techstack": {
    "title": "Tech Stack",
    "tools": "Tools"
  },
  "habilities": {
    "passionate": "Passionate",
    "creative": "Creative",
    "proactive": "Proactive",
    "cooperative": "Cooperative",
    "responsible": "Responsible"
  },
  "experience": {
    "title": "Experience",
    "marketec360": {
      "date": "March 2025",
      "title": "Frontend Developer",
      "description": "Frontend developer at Marketec360, where I have worked on the development of web applications using modern technologies such as React, TypeScript, and Tailwind CSS. I have collaborated on large-scale projects, improving user experience and building responsive and accessible interfaces."
    },
    "searching": {
      "date": "Currently",
      "title": "Looking for new opportunities",
      "description": "I am currently looking for new job opportunities where I can apply my skills and continue to grow professionally. I am open to challenging projects that allow me to learn and contribute to the team's success."
    }
  },
  "projects": {
    "title": "Projects"
  },
  "footer": {
    "builtWith": "Built with",
    "followMe": "Follow me",
    "legal": "Legal",
    "privacyPolicy": "Privacy Policy",
    "termsAndConditions": "Terms and Conditions",
    "allRightsReserved": "All rights reserved."
  },
    "privacy": {
    "title": "Privacy Policy",
    "lastUpdate": "Last updated: June 4, 2025",
    "intro": "This privacy policy explains how user information is collected, used, and protected when visiting this website.",
    "section1": {
      "title": "1. Information Collected",
      "content": "Personal data you provide through the contact form (such as your name and email address). Data automatically collected through tools like Google Analytics (for example, your IP address, browser, pages visited, and browsing time)."
    },
    "section2": {
      "title": "2. Use of Information",
      "content": "The information collected is used exclusively to respond to requests sent through the form and to improve the user experience on the site."
    },
    "section3": {
      "title": "3. Sharing Data with Third Parties",
      "content": "Your personal information is not sold, exchanged, or shared with third parties, except for the use of analytics services such as Google Analytics."
    },
    "section4": {
      "title": "4. Cookies",
      "content": "This site may use cookies to collect anonymous statistical data. You can disable cookies in your browser settings."
    },
    "section5": {
      "title": "5. User Rights",
      "content": "You have the right to access, rectify, or delete your personal data at any time. To do so, you can write to: [youremail@example.com]"
    },
    "section6": {
      "title": "6. Changes to this Policy",
      "content": "This policy may be updated occasionally. It is recommended to check it regularly."
    }
    },
  "terms": {
    "title": "Terms and Conditions",
    "lastUpdate": "Last updated: June 4, 2025",
    "intro": "By accessing this website, you agree to the following terms and conditions. If you do not agree with any of them, please do not use the site.",
    "section1": {
      "title": "1. Intellectual Property",
      "content": "All content on this site (texts, images, designs, code, etc.) is the property of the portfolio author, unless otherwise indicated. Reproduction without prior authorization is not permitted."
    },
    "section2": {
      "title": "2. Use of the Site",
      "content": "This site is for informational and professional purposes. It is prohibited to use it for illegal activities or those that infringe the rights of third parties."
    },
    "section3": {
      "title": "3. External Links",
      "content": "The site may contain links to other websites. I am not responsible for the content or privacy policies of those sites."
    },
    "section4": {
      "title": "4. Disclaimer",
      "content": "This site is provided \"as is\", without guarantees of availability, accuracy, or uninterrupted operation."
    },
    "section5": {
      "title": "5. Modifications",
      "content": "The terms set forth here may change without prior notice. Continued use of the site implies acceptance of such changes."
    }
  }
}